In [228]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [229]:
df = pd.read_csv('train.csv')

df_test = pd.read_csv('test.csv')

In [230]:
df.columns

Index(['PassengerId', 'HomePlanet', 'CryoSleep', 'Cabin', 'Destination', 'Age',
       'VIP', 'RoomService', 'FoodCourt', 'ShoppingMall', 'Spa', 'VRDeck',
       'Name', 'Transported'],
      dtype='object')

In [231]:
df.head()

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported
0,0001_01,Europa,False,B/0/P,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,0.0,0.0,Maham Ofracculy,False
1,0002_01,Earth,False,F/0/S,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,549.0,44.0,Juanna Vines,True
2,0003_01,Europa,False,A/0/S,TRAPPIST-1e,58.0,True,43.0,3576.0,0.0,6715.0,49.0,Altark Susent,False
3,0003_02,Europa,False,A/0/S,TRAPPIST-1e,33.0,False,0.0,1283.0,371.0,3329.0,193.0,Solam Susent,False
4,0004_01,Earth,False,F/1/S,TRAPPIST-1e,16.0,False,303.0,70.0,151.0,565.0,2.0,Willy Santantines,True

In [232]:
df.drop(columns=['Name','CryoSleep', 'Cabin'], axis=1,inplace=True)
df.head()

,PassengerId,HomePlanet,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Transported
0,0001_01,Europa,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,0.0,0.0,False
1,0002_01,Earth,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,549.0,44.0,True
2,0003_01,Europa,TRAPPIST-1e,58.0,True,43.0,3576.0,0.0,6715.0,49.0,False
3,0003_02,Europa,TRAPPIST-1e,33.0,False,0.0,1283.0,371.0,3329.0,193.0,False
4,0004_01,Earth,TRAPPIST-1e,16.0,False,303.0,70.0,151.0,565.0,2.0,True

In [233]:
df_test.drop(columns=['Name','CryoSleep', 'Cabin'], axis=1,inplace=True)
df_test.head()

,PassengerId,HomePlanet,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck
0,0013_01,Earth,TRAPPIST-1e,27.0,False,0.0,0.0,0.0,0.0,0.0
1,0018_01,Earth,TRAPPIST-1e,19.0,False,0.0,9.0,0.0,2823.0,0.0
2,0019_01,Europa,55 Cancri e,31.0,False,0.0,0.0,0.0,0.0,0.0
3,0021_01,Europa,TRAPPIST-1e,38.0,False,0.0,6652.0,0.0,181.0,585.0
4,0023_01,Earth,TRAPPIST-1e,20.0,False,10.0,0.0,635.0,0.0,0.0

In [234]:
df.describe()

,Age,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck
count,8514.000000,8512.000000,8510.000000,8485.000000,8510.000000,8505.000000
mean,28.827930,224.687617,458.077203,173.729169,311.138778,304.854791
std,14.489021,666.717663,1611.489240,604.696458,1136.705535,1145.717189
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,19.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,27.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,38.000000,47.000000,76.000000,27.000000,59.000000,46.000000
max,79.000000,14327.000000,29813.000000,23492.000000,22408.000000,24133.000000

In [235]:
df.shape

(8693, 11)

In [236]:
df_test.shape

(4277, 10)

In [237]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8693 entries, 0 to 8692
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PassengerId   8693 non-null   object
 1   HomePlanet    8492 non-null   object
 2   Destination   8511 non-null   object
 3   Age           8514 non-null   float64
 4   VIP           8490 non-null   object
 5   RoomService   8512 non-null   float64
 6   FoodCourt     8510 non-null   float64
 7   ShoppingMall  8485 non-null   float64
 8   Spa           8510 non-null   float64
 9   VRDeck        8505 non-null   float64
 10  Transported   8693 non-null   bool
dtypes: bool(1), float64(6), object(4)
memory usage: 687.8+ KB

In [238]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4277 entries, 0 to 4276
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PassengerId   4277 non-null   object
 1   HomePlanet    4190 non-null   object
 2   Destination   4185 non-null   object
 3   Age           4186 non-null   float64
 4   VIP           4184 non-null   object
 5   RoomService   4195 non-null   float64
 6   FoodCourt     4171 non-null   float64
 7   ShoppingMall  4179 non-null   float64
 8   Spa           4176 non-null   float64
 9   VRDeck        4197 non-null   float64
dtypes: float64(6), object(4)
memory usage: 334.3+ KB

In [239]:
df['Transported'].value_counts()

True     4378
False    4315
Name: Transported, dtype: int64

## Data Cleaning

Identificando colunas com valores nulos

Categóricas:

In [240]:
for col in df.select_dtypes(include=['object']).columns:
    print(col)

PassengerId
HomePlanet
Destination
VIP

In [241]:
for col in df_test.select_dtypes(include=['object']).columns:
    print(col)

PassengerId
HomePlanet
Destination
VIP

Numéricas:

In [242]:
for col in df._get_numeric_data().columns:
    print(col)

Age
RoomService
FoodCourt
ShoppingMall
Spa
VRDeck
Transported

In [243]:
for col in df_test._get_numeric_data().columns:
    print(col)

Age
RoomService
FoodCourt
ShoppingMall
Spa
VRDeck

Tratando colunas valores numéricos

In [244]:
numerical_variables = df._get_numeric_data().columns
for num_col in numerical_variables:
    df[num_col] = df[num_col].fillna(df[num_col].mean())

In [245]:
numerical_variables_test = df_test._get_numeric_data().columns
for num_col in numerical_variables_test:
    df_test[num_col] = df_test[num_col].fillna(df_test[num_col].mean())

In [246]:
for num_col in numerical_variables:
    print(num_col, df[num_col].isnull().sum())

Age 0
RoomService 0
FoodCourt 0
ShoppingMall 0
Spa 0
VRDeck 0
Transported 0

In [247]:
df['Bill'] = df['RoomService']+df['FoodCourt']+df['ShoppingMall']+df['Spa']+df['VRDeck']

In [248]:
df_test['Bill'] = df_test['RoomService']+df_test['FoodCourt']+df_test['ShoppingMall']+df_test['Spa']+df_test['VRDeck']

In [249]:
df.columns

Index(['PassengerId', 'HomePlanet', 'Destination', 'Age', 'VIP', 'RoomService',
       'FoodCourt', 'ShoppingMall', 'Spa', 'VRDeck', 'Transported', 'Bill'],
      dtype='object')

In [250]:
df.drop(columns=['PassengerId','RoomService','FoodCourt', 'ShoppingMall', 'Spa', 'VRDeck'], axis=1,inplace=True)
df.head()

  HomePlanet  Destination   Age    VIP  Transported     Bill
0     Europa  TRAPPIST-1e  39.0  False        False      0.0
1      Earth  TRAPPIST-1e  24.0  False         True    736.0
2     Europa  TRAPPIST-1e  58.0   True        False  10383.0
3     Europa  TRAPPIST-1e  33.0  False        False   5176.0
4      Earth  TRAPPIST-1e  16.0  False         True   1091.0

In [251]:
df_test.drop(columns=['PassengerId','RoomService','FoodCourt', 'ShoppingMall', 'Spa', 'VRDeck'], axis=1,inplace=True)
df.head()

  HomePlanet  Destination   Age    VIP  Transported     Bill
0     Europa  TRAPPIST-1e  39.0  False        False      0.0
1      Earth  TRAPPIST-1e  24.0  False         True    736.0
2     Europa  TRAPPIST-1e  58.0   True        False  10383.0
3     Europa  TRAPPIST-1e  33.0  False        False   5176.0
4      Earth  TRAPPIST-1e  16.0  False         True   1091.0

In [252]:
for col in df._get_numeric_data().columns:
    print(col)

Age
Transported
Bill

In [253]:
df = pd.get_dummies(df)
df_test = pd.get_dummies(df_test)

In [254]:
df.head()

,Age,Transported,Bill,HomePlanet_Earth,HomePlanet_Europa,HomePlanet_Mars,Destination_55 Cancri e,Destination_PSO J318.5-22,Destination_TRAPPIST-1e,VIP_False,VIP_True
0,39.0,False,0.0,0,1,0,0,0,1,1,0
1,24.0,True,736.0,1,0,0,0,0,1,1,0
2,58.0,False,10383.0,0,1,0,0,0,1,0,1
3,33.0,False,5176.0,0,1,0,0,0,1,1,0
4,16.0,True,1091.0,1,0,0,0,0,1,1,0

In [255]:
df.columns

Index(['Age', 'Transported', 'Bill', 'HomePlanet_Earth', 'HomePlanet_Europa',
       'HomePlanet_Mars', 'Destination_55 Cancri e',
       'Destination_PSO J318.5-22', 'Destination_TRAPPIST-1e', 'VIP_False',
       'VIP_True'],
      dtype='object')

In [256]:
df.drop(columns=['HomePlanet_Mars','Destination_TRAPPIST-1e','VIP_False'], axis=1,inplace=True)
df.head()

,Age,Transported,Bill,HomePlanet_Earth,HomePlanet_Europa,Destination_55 Cancri e,Destination_PSO J318.5-22,VIP_True
0,39.0,False,0.0,0,1,0,0,0
1,24.0,True,736.0,1,0,0,0,0
2,58.0,False,10383.0,0,1,0,0,1
3,33.0,False,5176.0,0,1,0,0,0
4,16.0,True,1091.0,1,0,0,0,0

In [257]:
df_test.drop(columns=['HomePlanet_Mars','Destination_TRAPPIST-1e','VIP_False'], axis=1,inplace=True)

In [258]:
df['Age'] = df['Age'].apply(lambda x: int(x))
df_test['Age'] = df_test['Age'].apply(lambda x: int(x))

In [259]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8693 entries, 0 to 8692
Data columns (total 8 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Age                        8693 non-null   int64
 1   Transported                8693 non-null   bool
 2   Bill                       8693 non-null   float64
 3   HomePlanet_Earth           8693 non-null   uint8
 4   HomePlanet_Europa          8693 non-null   uint8
 5   Destination_55 Cancri e    8693 non-null   uint8
 6   Destination_PSO J318.5-22  8693 non-null   uint8
 7   VIP_True                   8693 non-null   uint8
dtypes: bool(1), float64(1), int64(1), uint8(5)
memory usage: 186.9 KB

In [260]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4277 entries, 0 to 4276
Data columns (total 7 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Age                        4277 non-null   int64
 1   Bill                       4277 non-null   float64
 2   HomePlanet_Earth           4277 non-null   uint8
 3   HomePlanet_Europa          4277 non-null   uint8
 4   Destination_55 Cancri e    4277 non-null   uint8
 5   Destination_PSO J318.5-22  4277 non-null   uint8
 6   VIP_True                   4277 non-null   uint8
dtypes: float64(1), int64(1), uint8(5)
memory usage: 87.8 KB

In [261]:
df.describe()

,Age,Bill,HomePlanet_Earth,HomePlanet_Europa,Destination_55 Cancri e,Destination_PSO J318.5-22,VIP_True
count,8693.000000,8693.000000,8693.000000,8693.000000,8693.000000,8693.000000,8693.000000
mean,28.810882,1472.487559,0.529391,0.245140,0.207063,0.091568,0.022892
std,14.339536,2799.915709,0.499164,0.430195,0.405224,0.288432,0.149568
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,20.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,27.000000,727.000000,1.000000,0.000000,0.000000,0.000000,0.000000
75%,37.000000,1461.000000,1.000000,0.000000,0.000000,0.000000,0.000000
max,79.000000,35987.000000,1.000000,1.000000,1.000000,1.000000,1.000000

## Hold out